org/topics/serial_connections.org
#+created: 20150930163242177
#+creator: boru
#+modified: 20210518184432895
#+modifier: boru
#+revision: 0
#+tags: [[Layer 3]]
#+title: Serial Connections
#+tmap.id: 0f4974a9-19a4-48bf-b3c9-e5160be2f091
#+type: text/vnd.tiddlywiki

- CSU :: Channel Service Unit
- DSU :: Data Service Unit
- DCE :: Data Connecting Equipment
  Provides *clocking*
  Has the equivalent task of an [[#Ethernet][Ethernet]] crossover cable by swapping the transmit and receive wire pairs
- DTE :: Data Terminating Equipment
  Used between Routers and CSU/DSU
- HDLC :: High Level Data Link Control
  Default *encapsulation* type for a serial connection
- Clocking :: CSU/DSU tells the router when to exactly send each bit through signaling over the serial cable

** Implenting [[#WAN][WAN]] in a Lab
:PROPERTIES:
:CUSTOM_ID: implenting-wan-in-a-lab
:END:
** Serial connections
:PROPERTIES:
:CUSTOM_ID: serial-connections
:END:
- Denoted by a bolt connection
- Termination Point
- the router will have a serial connection to a demarcation point
- where the responsabilities of the ISP ends

** Commands
:PROPERTIES:
:CUSTOM_ID: commands
:END:
#+begin_example
r1 (config)# show ip interface brief
#+end_example

you will get

| Method | Protocol | Issue   |
| down   | down     | Layer 1 |
| up     | down     | Layer 2 |

With Layer 2 issues

- no keep-alives
- missmatch encapsulation
- no clock rate set on *DCE* end

** Lab
:PROPERTIES:
:CUSTOM_ID: lab
:END:
/30 is used only for *point-to-point* serial connections.

Router 1: 200.200.200.1* *DCE* device

- provides clocking
- DTE (Data Terminating Equipment) device
- router

Router 2: 200.200.200.2

/30 will have a block size of 4. So first network will be between 200.200.200.1 - 200.200.200.3 where 200.200.200.3 is the broadcast address.

*** router r201
:PROPERTIES:
:CUSTOM_ID: router-r201
:END:
#+begin_example
r201# show interfaces serial 0/1/0
#+end_example

Serial interfaces have no MAC addresses.

Sign IP address:

#+begin_example
r201# show ip interface brief
r201# configure terminal
r201(config)# interface serial 0/1/0

# /30 network mask
r201(config-if)# ip address 200.200.200.255.255.255.252
r201(config-f)# no shutdown
#+end_example

*** router 1
:PROPERTIES:
:CUSTOM_ID: router-1
:END:
#+begin_example
r1# conf
r1# configure terminal
r1(config)# interface serial 0/0/0
r1(config-if)# ip address 200.200.200.1 255.255.255.252
r1(config-if)# no shutdown
#+end_example

Make sure interface is up:

#+begin_example
r1# show ip interface brief
r1#ping 200.200.200.2
#+end_example

Change clock rate:

#+begin_example
r1#configure t
r1(config)# interface serial 0/0/0

# 128k bit/s
r1(config-if)# clock rate 128000

r1(config-if)# do show controllers serial 0/0/0
#+end_example

*** DTE/DCE
:PROPERTIES:
:CUSTOM_ID: dtedce
:END:
Figure out which side is the DCE/DTE side:

#+begin_example
r1# show controllers serial 0/0/0
...
DCE V.35, clock rate 2000000
...
#+end_example

Check the other end:

#+begin_example
r201# controllers serial 0/1/0
...
DTE V.35 TX and RX clocks detected
...
#+end_example
